loadtest/load-test-read-only.yml
config:
  target: "{{ $processEnvironment.API_URL }}"
  http:
    timeout: 60
  processor: "generator-read-only.js"
  phases:
    - duration: 300
      arrivalRate: 30
  plugins:
    metrics-by-endpoint:
      # Group metrics by request name rather than URL:
      useOnlyRequestNames: true

scenarios:
  - name: "Get products"
    flow:
      - get:
          url: "/"
          name: "get_all_products"
          afterResponse: getRandomId
      - get:
          url: "/{{ id }}"
          name: "get_product_by_id"