loadtest/load-test.yml
config:
  target: "{{ $processEnvironment.API_URL }}"
  http:
    timeout: 60
  processor: "generator.js"
  phases:
    - duration: 300
      arrivalRate: 30
  plugins:
    metrics-by-endpoint:
      # Group metrics by request name rather than URL:
      useOnlyRequestNames: true
scenarios:
  - name: "Generate products"
    weight: 1
    flow:
      - function: "generateProduct"
      - put:
          url: "/{{ id }}"
          name: "create_product"
          headers:
            Content-Type: "application/json"
          json:
            id: "{{ id }}"
            name: "{{ name }}"
            price: "{{ price }}"
      - get:
          url: "/{{ id }}"
          name: "get_product_by_id"
      - think: 3
      - delete:
          url: "/{{ id }}"
          name: "delete_product"
  - name: "Generate products without delete"
    weight: 1
    flow:
      - function: "generateProduct"
      - put:
          url: "/{{ id }}"
          name: "create_product"
          headers:
            Content-Type: "application/json"
          json:
            id: "{{ id }}"
            name: "{{ name }}"
            price: "{{ price }}"
      - get:
          url: "/{{ id }}"
          name: "get_product_by_id"
      - think: 3
  - name: "Get products"
    weight: 8
    flow:
      - get:
          url: "/"
          name: "get_all_products"