loadtest/load-test.yml
config:
  target: "{{ $processEnvironment.API_URL }}"
  http:
    timeout: 60
  processor: "generator.js"
  phases:
    - duration: 300
      arrivalRate: 30

scenarios:
  - name: "Generate products"
    weight: 1
    flow:
      - function: "generateProduct"
      - put:
          url: "/{{ id }}"
          headers:
            Content-Type: "application/json"
          json:
            id: "{{ id }}"
            name: "{{ name }}"
            price: "{{ price }}"
      - get:
          url: "/{{ id }}"
      - think: 3
      - delete:
          url: "/{{ id }}"
  - name: "Get products"
    weight: 9
    flow:
      - get:
          url: "/"